"%c is a" % 97    # 将asicc值转为字符
"%s: %s" % ('zhangsan', 25)  # %s 把元素转成字符形式
"%s: %d" % ('zhangsan', 25)  # %d 表示要转成十进制整数
"5 / 2 = %d" % (5/2)  # 5/2=2.5保留整数替换%d
"%o" % 10  # 转成8进制数
"%#o" % 10  # 转成8进制数，加上前缀
"%#x" % 10  # 转成16进制数，加上前缀
"%e" % 10000  # 科学计数法
"5 / 2 = %f" % (5 / 2)  # 转换成浮点数
"%4.2f" % (5 / 2)  # 浮点数总宽度为4，小数点占两位
"%20s%8s" % ('name', 'age') # name有20个宽度，age是8个
"%20s%8s" % ('zhangsan', 25)
"%-20s%-8s" % ('name', 'age')  # 负数表示左对齐
"%-20s%-8s" % ('zhangsan', 25)
"% d" % 20  # 正数前加空格，负数没有
"%+d" % 20 # 正数前加+号，负数前没有
"%010d" % 20 # 数字不够10个宽度，前面用0填充









